Repository: omegaengine/omegaengine
Catalog: src/OmegaEngine/Properties/Resources.*.resx
Languages: de

# AngleNotBelow90
source: Value must be smaller than 90 degrees
de: Der Wert muss kleiner als 90 Grad sein.

# BadGraphics
source: This game is not supported by your graphics card.
de: Ihre Grafikkarte wird von diesem Spiel nicht unterstützt.

# CallMethodOnlyOnce
source: This method may be called only once on this object.
de: Diese Methode darf nur einmal auf diesem Objekt aufgerufen werden.

# DirectXMissing
source: The required version of DirectX is not installed on your computer.
de: Die benötigte Version von DirectX ist auf Ihrem Computer nicht installiert.

# DumpFail
source: Failed to dump view data to file.
de: Speichern der View Daten in eine Datei fehlgeschlagen.

# DynamicShaderCompileFail
source: The dynamic shader could not be compiled.
de: Der dynamische Shader konnte nicht kompiliert werden.

# EngineCannotChange
source: Engine can not be changed again once it has been set.
de: Engine kann nicht wieder geändert werden, nachdem Sie gesetzt wurde.

# EngineNotSetYet
source: Engine has not been set yet.
de: Engine wurde noch nicht gesetzt.

# InvalidScreenshotSize
source: The screenshot resolution must not exceed the current render resolution.
de: Die Screenshot-Auflösung darf die aktuelle Render-Auflösung nicht überschreiten.

# LightsNotDeactivated
source: DeactivateLights was not called after the last render pass.
de: DeactivateLights wurde nach dem letzten Renderdurchlauf nicht aufgerufen.

source: Loading music...
de: Lade Musik...

# MeshIndexBufferNot16bit
source: The mesh doesn't use 16-bit indices.
de: Das Mesh verwendet keine 16-bit Indizes.

# MeshIndexBufferNot32bit
source: The mesh doesn't use 32-bit indices.
de: Das Mesh verwendet keine 32-bit Indizes.

# MinimumShaderModel
source: You need a graphics card that supports at least Shader Model {0}.
de: Sie benötigen eine Grafikkarte die mindestens Shader Model {0} unterstützt.

# NoDebugInFullscreen
source: The engine debug interface cannot be activated while in fullscreen mode.
de: Die Engine Debug Oberfläche kann nicht im Vollbild-Modus aufgerufen werden.

# NoLinearTextureFiltering
source: Your graphics card does not support linear texture filtering.
de: Ihre Grafikkarte unterstützt kein lineares Textur Filtern.

# NoModifyTerrainColorWithoutLighting
source: The terrain color can't be modified if terrain lighting is disabled.
de: Die Terrain Farbe kann nicht modifziert werden, wenn Terrain Beleuchtung deaktiviert ist.

# NoModifyTerrainHeightWithLighting
source: The terrain height-map can't be modified if terrain lighting is enabled.
de: Die Terrain "Height-Map" kann nicht modifziert werden, wenn Terrain Beleuchtung aktiviert ist.

# NoSuchBody
source: There was no such body found:
de: Es wurde kein derartiges Body gefunden:

# NoSuchLightSource
source: There was no such light source found:
de: Es wurde keine derartige Lichtquelle gefunden:

# NotAvailable
source: A required graphics feature was not available
de: Ein benötigtes Grafikfeature war nicht verfügbar

# NotFoundShaderFile
source: The following shader data file could not be found:
de: Die folgende Shader-Datei konnte nicht gefunden werden:

# NotSupportedShader
source: This shader is not supported by your graphics card.
de: Dieser Shader wird von Ihrer Grafikkarte nicht unterstützt.

# NumberNotReal
source: The value must be a real number.
de: Der Wert muss eine reelle Zahl sein.

# ReleasedTooOften
source: The Release method was called to often on {0}.
de: Die Release Methode wurde zu oft auf {0} aufgerufen.

# SongAlreadyLoaded
source: This song was loaded more than once:
de: Dieses Musikstück wurde mehrfach geladen:

# SongLoadFailed
source: Failed to load song:
de: Konnte Lied nicht laden:

# UnknownVertexFormat
source: The specified vertex format is not known.
de: Das angegebene Vertexformat ist unbekannt.

# ValueNotPositive
source: The value must be greater than 0.
de: Der Wert muss größer als 0 sein.

# VBMustBeFVF
source: The vertex buffer must use a fixed-function vertex format.
de: Der Vertex-Puffer muss ein fixed-function Vertex-Format verwenden.

# WrongAssetType
source: The following file was previously loaded as a different asset type:
de: Die folgende Datei wurde bereits als ein anderer Asset-Typ geladen:

# WrongHeightMapSize
source: Height-map size must equal terrain size.
de: "Height-Map" muss gleiche Größe wie Terrain haben.

# WrongOcclusionIntervalMapSize
source: Occlusion interval map size must equal terrain size.
de: Occlusion Interval Map muss gleiche Größe wie Terrain haben.

# WrongTexArrayLength
source: The array must have a length of {0}.
de: Das Array muss eine Länge von {0} haben.

# WrongTextureMapSize
source: Texture-map size must be exactly a third of the terrain size.
de: "Texture-Map" muss genau ein Drittel der Terriangröße sein.

# WrongVertexCountLine
source: Number of vertexes must be a multiple of 2 for a LineList.
de: Die Anzahl der Vertexes muss für eine LineList ein Vielfaches von 2 sein.

# WrongVertexCountTriangle
source: Number of vertexes must be a multiple of 3 for a TriangleList.
de: Die Anzahl der Vertexes muss für eine TriangleList ein Vielfaches von 3 sein.
